/////////////////////////////////////////////////////////////
//معدل کاربر را دریافت کرده و سپس سطح او را تعیین کنید

//A برای معدل 18 الی 20 سطح
//B برای معدل 15 الی 17 سطح
//C برای معدل 12 الی 14 سطح
//معدل کمتر از 12 مشروط میشه :(

var ave=+prompt("معدل کاربر را وارد کنید:",0)


// if( ave>=18 && ave<=20){
//     alert("شما در سطح A قرار دارید.")
// } else if(ave>=15 && ave<18){
//     alert("شما در سطح B قرار دارید.")
// } else if(ave>=12 && ave<15){
//     alert("شما در سطح C قرار دارید.")
// } else if(ave>=0 && ave<12){
//     alert("شما مشروط شدید.")
// } else{
//     alert("معدل صحیح وارد نشده است.")
// }
   


switch(ave){
    case 20:
    case 19:
    case 18:
        alert("شما در سطح A قرار دارید.")
        break
    case 17:
    case 16:
    case 15:    
        alert("شما در سطح B قرار دارید.")
        break    
    case 14:
    case 13:
    case 12:   
        alert("شما در سطح C قرار دارید.")
        break      
    default:
        alert("شما مشروط شدید.")     
}



